app/views/articles/show.html.erb

<h2>Posts</h2>
<% @article.posts.each do |post| %>
---
SELECT "posts".* FROM "posts" WHERE "posts"."article_id" = ?  [["article_id", 2]]