app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)
    @book.user= current_user
    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "jungle"], ["body", "its me "], ["user_id", 1], ["created_at", "2020-07-17 13:29:44.480950"], ["updated_at", "2020-07-17 13:29:44.480950"]]

  def update
    respond_to do |format|
      if @book.update(book_params)
---
UPDATE "books" SET "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["body", "its me f"], ["updated_at", "2020-07-17 14:17:22.371854"], ["id", 1]]