app/controllers/posts_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "posts" ("commenter", "body", "phone", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["commenter", "erget"], ["body", "ergerger"], ["phone", "3453435"], ["article_id", 2], ["created_at", "2020-07-14 09:49:14.574012"], ["updated_at", "2020-07-14 09:49:14.574012"]]
---
	def create
    	@article = Article.find(params[:article_id])
    	@post = @article.posts.create(post_params)

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 1]]
---
 	def destroy
    	# @article = Article.find(params[:article_id])
    	@post = Post.find(params[:id])
    	@post.destroy